---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.KingNeverInOption
source: html/8f420a68-e3ba-0a70-924e-9aa8bef583da.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.KingNeverInOption Property

A selected "[Serf]" belongs to a "[King]" which cannot be added to an Option--it was not added to the Option Set.

## Syntax (C#)
```csharp
public static FailureDefinitionId KingNeverInOption { get; }
```